#include <REGX52.H>

//**    ¶¨Ê±Æ÷0³õÊ¼»¯

void Timer0_Init(void)		//1ºÁÃë@12.000MHz
{
	//AUXR &= 0x7F;			//¶¨Ê±Æ÷Ê±ÖÓ12TÄ£Ê½
	TMOD &= 0xF0;			//ÉèÖÃ¶¨Ê±Æ÷Ä£Ê½
	TMOD |= 0x01;			//ÉèÖÃ¶¨Ê±Æ÷Ä£Ê½
	TL0 = 0x9C;				//è®¾ç½®å®šæ—¶åˆå§‹å€¼
	TH0 = 0xFF;				//è®¾ç½®å®šæ—¶åˆå§‹å€¼

	TF0 = 0;				//Çå³ýTF0±êÖ¾
	TR0 = 1;				//¶¨Ê±Æ÷0¿ªÊ¼¼ÆÊ±
    ET0 = 1;
    EA = 1;
    PT0 = 0; 
}


//**¶¨Ê±Æ÷ÖÐ¶Ïº¯ÊýÄ£°å
//void Timer0_Routine() interrupt 1
//{
//    static unsigned int T0Count = 0;
//   TL0 = 0x9C;				//è®¾ç½®å®šæ—¶åˆå§‹å€¼
//	TH0 = 0xFF;				//è®¾ç½®å®šæ—¶åˆå§‹å€¼
//    T0Count++;
//    if(T0Count >= 1000)
//    {
//        T0Count = 0;
//        P2_0 = ~P2_0;
//    }
//}